{
  "_id": ObjectId("58b0ab4eff75c44a8ca38abc"),
  "createdAt": "2017-02-24T21:53:18.697Z",
  "firstName": "Harry",
  "lastName": "Potter",
  "hashedPassword": "1234567890123456",
  "jobs": [
    {
        "_id": ObjectId("58b0ab4eff75c44a8ca38abd"),
        "company": "Randstad Technologies",
        "location": "Denver, CO",
        "url": "http://job-openings.monster.com/v2/job/View?JobID=181283303&MESCOID=1500127001001&jobPosition=2",
        "createdAt": "2017-02-24T22:05:11.643Z",
        "description": "<p>This role will be responsible for front end web page development and working with various content management systems (CMS) to create and deploy content for websites.</p><p><br /><br /></p><p><span>Responsibilities Include:</span></p><p><br /><br /><br /><span>&bull; Developing cross-browser and cross-platform compatible solutions using HTML/CSS/JavaScript</span><br /><span>&bull; Maintaining client portals in Alfresco content management system.</span><br /><span>&bull; Providing accurate timing estimates on front end website development efforts.</span><br /><span>&bull; Contributing to documentation</span><br /><span>&bull; Develop and test across multiple browsers, platforms, and devices, including smartphones and tablets.</span><br /><span>&bull; Backwards compatibility coding</span><br /><br /><br /></p><p><span>Knowledge &amp; Skills</span></p><p><br /><br /><br /><span>&bull; Working knowledge of JavaScript and the jQuery library</span><br /><span>&bull; knowledge of web and mobile UX/UI</span><br /><span>&bull; Ability to estimate effort based on high level requirements.</span><br /><span>&bull; Experience with Subversion or other version control system</span><br /><span>&bull; Experience integrating HTML/CSS with Java server-side code using Eclipse/MyEclipse</span><br /><span>&bull; 3 - 6 years of overall professional experience in designing and development of rich web based applications.</span><br /><span>&bull; Sound understanding of web analytics in relation to web design</span><br /><span>&bull; Understanding/familiarity with Web Accessibility / ADA</span><br /><span>&bull; Results oriented with strong customer focus and good communication skills.</span><br /><span>&bull; Demonstrated ability to exercise good judgment, prioritize multiple tasks, and problem solving under pressure of deadlines and resource constraints.</span><br /><span>&bull; Passion for work - willing to work extra hours if needed</span><br /><span>&bull; Must be very organized and able to work with other groups who are not.</span><br /><span>&bull; Familiarity with patternlab.io a big plus</span></p>",
        "notes": "Vinyl bespoke kogi, crucifix four loko semiotics affogato helvetica scenester vape kickstarter cronut yuccie ennui.",
        "tasks": {
            "coverLetterStatus": "fa-pencil",
            "deadline": "2017-03-05T22:05:11.643Z",
            "interview": {
                "date": "2017-03-01T10:30:11.643Z",
                "status": "fa-calendar-check-o"
            },
            "resumeStatus": "fa-pencil"
        },
        "title": "Front End Web Developer"
    },
    {
        "_id": ObjectId("58b0ab4eff75c44a8ca38abe"),
        "company": "Google",
        "createdAt": "2017-02-24T22:05:11.643Z",
        "description": "Raw denim flannel jean shorts raclette, kickstarter viral meggings ennui hexagon narwhal slow-carb four loko schlitz. Live-edge narwhal four dollar toast, subway tile locavore twee small batch direct trade franzen. Cray direct trade activated charcoal occupy wayfarers, swag succulents kale chips PBR&B. Ennui swag tote bag, poutine gochujang readymade wolf migas fingerstache. Chicharrones franzen photo booth craft beer twee. Gastropub vaporware brunch plaid master cleanse kale chips. Squid leggings woke irony, cray selvage actually fingerstache.",
        "notes": "Twee squid jianbing swag hexagon, sustainable dreamcatcher normcore.",
        "tasks": {
            "coverLetterStatus": "fa-minus",
            "deadline": "2017-03-29T22:05:11.643Z",
            "interview": {
                "date": "fa-minus",
                "status": "fa-minus"
            },
            "resumeStatus": "fa-pencil"
        },
        "title": "Front End Consultant"
    },
    {
        "_id": ObjectId("58b0ab4eff75c44a8ca38abf"),
        "company": "Zayo Group",
        "createdAt": "2017-02-24T22:05:11.643Z",
        "description": "Fap austin swag, offal skateboard wayfarers freegan lyft photo booth chicharrones trust fund ramps letterpress synth hell of. XOXO banh mi edison bulb tbh williamsburg, irony mustache. Yr cold-pressed slow-carb, gluten-free pop-up jianbing copper mug locavore fixie. Flannel plaid pabst, vinyl bitters chillwave mixtape 8-bit banjo normcore prism enamel pin iPhone. Brooklyn blog hashtag, drinking vinegar kogi keytar brunch scenester offal next level godard. Chicharrones flexitarian fashion axe man braid, next level ugh fixie mustache paleo vegan PBR&B ennui af humblebrag poke. 90's forage meditation unicorn, put a bird on it gastropub tilde tattooed. \n Portland mumblecore gluten-free letterpress jean shorts sartorial subway tile keytar. Knausgaard single-origin coffee echo park, crucifix vaporware tilde blog distillery poutine shoreditch hell of. Chambray cardigan 3 wolf moon deep v green juice, butcher banh mi yr prism squid church-key helvetica. Shabby chic sustainable tattooed, direct trade affogato you probably haven't heard of them authentic put a bird on it brooklyn. Fap biodiesel mixtape activated charcoal. Kombucha artisan fixie, flannel messenger bag locavore jianbing letterpress. Portland iceland kale chips knausgaard mustache neutra. \n Dreamcatcher next level bushwick post-ironic enamel pin. Photo booth celiac whatever beard man bun, vegan skateboard listicle. Small batch kinfolk chia, lumbersexual air plant prism godard hell of. Hammock letterpress +1 drinking vinegar, activated charcoal everyday carry try-hard. Leggings kogi vexillologist, pitchfork small batch 3 wolf moon gluten-free cred. Raw denim sartorial succulents celiac, post-ironic wayfarers pickled enamel pin chillwave keytar irony chia slow-carb. 90's lo-fi kombucha swag kitsch bicycle rights.",
        "notes": "Small batch kinfolk chia, lumbersexual air plant prism godard hell of. Hammock letterpress +1 drinking vinegar, activated charcoal everyday carry try-hard.",
        "tasks": {
            "coverLetterStatus": "fa-pencil",
            "deadline": "fa-minus",
            "interview": {
                "date": "fa-minus",
                "status": "fa-minus"
            },
            "resumeStatus": "fa-pencil"
        },
        "title": "Project Manager"
    },
    {
        "_id": ObjectId("58b0ab4eff75c44a8ca38aba"),
        "company": "Galvanize",
        "createdAt": "2017-02-24T22:05:11.643Z",
        "description": "Keytar celiac fashion axe, disrupt craft beer venmo kale chips DIY before they sold out synth typewriter gochujang unicorn. Master cleanse franzen church-key put a bird on it yuccie keytar. Raclette copper mug lomo, PBR&B brooklyn street art butcher roof party. Chicharrones vaporware organic blog sartorial vinyl. Pop-up cred hell of direct trade +1, organic fashion axe post-ironic. Tumeric kickstarter organic keytar offal, man bun PBR&B. Coloring book meh jianbing, tbh kickstarter twee kale chips hot chicken fap art party. \n Irony put a bird on it cold-pressed four dollar toast trust fund. Prism hoodie PBR&B, pour-over umami raclette hammock bicycle rights before they sold out health goth craft beer snackwave williamsburg gochujang. Sustainable portland quinoa, forage small batch mlkshk migas truffaut kogi jianbing venmo wayfarers. Typewriter drinking vinegar aesthetic offal, etsy ethical prism small batch kinfolk fam kombucha irony art party flannel. Twee austin kickstarter bushwick, blog chicharrones tumeric 90's lomo disrupt narwhal. DIY kickstarter shoreditch kale chips you probably haven't heard of them aesthetic. Retro shoreditch pok pok hoodie.",
        "notes": null,
        "tasks": {
            "coverLetterStatus": "fa-minus",
            "deadline": "fa-minus",
            "interview": {
                "date": "fa-minus",
                "status": "fa-minus"
            },
            "resumeStatus": "fa-pencil"
        },
        "title": "Python Developer"
    }
  ]
}
